/****************************************
*  Author: Полозов В. А.                *
*  Name: Линейные алгоритмы             *
*  URL: https://onlinegdb.com/nADiKAb-h *
*****************************************/
#include <iostream>
#include <cmath>
#include <iomanip>
using namespace std;

int main() {
  double l, R1, R2, t1, t2, F, L, Q1, Q2, Q3;
  cout << "Теплопроводность стенки (в Вт / м * град) = ";
  cin >> l; // 59.034
  cout << "Расстояние от внутренней стороны стенки до источника тепла (в метрах) = ";
  cin >> R1; // 0.252
  cout << "Температура на внутренней стороне стенки (в градусах по Цельсию) = ";
  cin >> t1; // 264
  cout << "Расстояние от наружной стороны стенки до источника тепла (в метрах) = ";
  cin >> R2; // 0.293
  cout << "Температура на наружней стороне стенки (в градусах по Цельсию) = ";
  cin >> t2; // 43
  cout << "Площадь поверхности плоской стенки = ";
  cin >> F; // 0.53
  cout << "Длина цилиндрической стенки = ";
  cin >> L; // 1
  const double p = 3.1415926; // число пи
  
  Q1 = l * F / (R2 - R1) * (t1 - t2);
  Q2 = 2 * p * l * L / log( (R2 / R1) ) * (t1 - t2);
  Q3 = 4 * p * l / (1 / R1 - 1 / R2) * (t1 - t2);
  
  cout << std::fixed;
  cout << std::setprecision(6) << Q1 << '\n' << Q2 << '\n' << Q3;
  
  return 0;
}




